/****** Script for SelectTopNRows command from SSMS  ******/
SELECT TOP (1000) [Laba6]
  FROM [SUBD1].[dbo].[Laboratorna6]

CREATE VIEW аудиторії_2 AS SELECT DISTINCT Код_аудиторії, Номер, Тип 
FROM аудиторії;

select * from аудиторії_2
WHERE номер >= 120 AND номер < 400;

SELECT розклад.код_розкладу, аудиторії.номер, розклад.код_дня_тижня, розклад.код_пари 
FROM розклад, аудиторії 
WHERE розклад.код_аудиторії = аудиторії.код_аудиторії;

SELECT розклад.код_розкладу, аудиторії.номер, розклад.код_виду_занять
FROM розклад, аудиторії  
WHERE розклад.код_аудиторії = аудиторії.код_аудиторії AND розклад.код_виду_занять = 1;
